-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Час створення: Квт 29 2020 р., 20:03
-- Версія сервера: 10.4.11-MariaDB
-- Версія PHP: 7.4.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База даних: `treesbase`
--

-- --------------------------------------------------------

--
-- Структура таблиці `trees`
--

CREATE TABLE `trees` (
  `t_id` int(11) UNSIGNED NOT NULL,
  `t_vik` int(5) NOT NULL,
  `t_stan` int(2) NOT NULL,
  `t_poroda` varchar(20) NOT NULL,
  `t_plodu` varchar(11) NOT NULL,
  `t_positionN` varchar(11) NOT NULL,
  `t_positionE` varchar(11) NOT NULL,
  `t_info` text NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп даних таблиці `trees`
--

INSERT INTO `trees` (`t_id`, `t_vik`, `t_stan`, `t_poroda`, `t_plodu`, `t_positionN`, `t_positionE`, `t_info`) VALUES
(11, 1985, 5, 'Дуб        ', 'Жолудь   ', '48.529020', '25.049746', 'Немає'),
(12, 1975, 4, 'Абрикос  ', 'Абрикос  ', '48.531701', '25.060180', 'Немає'),
(13, 1987, 5, 'Береза     ', 'Немає      ', '48.531936', '25.062689', 'Немає'),
(14, 1964, 3, 'Вишня     ', 'Вишня     ', '48.532850', '25.060790', 'Немає'),
(35, 1953, 2, 'Вишня     ', 'Вишня     ', '48.532871', '25.062558', 'Немає'),
(16, 1965, 5, 'Каштан    ', 'Каштан    ', '48.533174', '25.042438', 'Немає'),
(17, 1975, 3, 'Клен       ', 'Немає      ', '48.543027', '25.032552', 'Немає'),
(18, 2015, 5, 'Слива      ', 'Слива      ', '48.531327', '25.036426', 'Немає'),
(19, 2011, 2, 'Сосна      ', 'Немає      ', '48.530095', '25.047100', 'Немає'),
(20, 2008, 5, 'Тополя     ', 'Немає      ', '48.527401', '25.044348', 'Немає'),
(21, 1944, 5, 'Черешня  ', 'Черешня ', '48.531471', '25.060301', 'Немає'),
(33, 1964, 5, 'Черешня  ', 'Черешня ', '48.531410', '25.060578', 'Немає'),
(23, 1988, 3, 'Ялинка     ', 'Немає      ', '48.528791', '25.053002', 'Немає'),
(25, 1975, 5, 'Слива      ', 'Слива      ', '48.529701', '25.058147', 'Немає'),
(26, 2008, 4, 'Яблуня     ', 'Яблука     ', '48.530021', '25.058950', 'Немає'),
(27, 1976, 5, 'Клен       ', 'Немає      ', '48.529111', '25.061736', 'Немає'),
(28, 2007, 4, 'Ялинка     ', 'Немає      ', '48.528299', '25.060547', 'Немає'),
(29, 1980, 5, 'Абрикос  ', 'Абрикос  ', '48.527535', '25.058790', 'Немає'),
(30, 1965, 3, 'Дуб        ', 'Немає      ', '48.526396', '25.049364', 'Немає'),
(31, 1963, 5, 'Вишня     ', 'Вишня     ', '48.532537', '25.035831', 'Немає'),
(32, 1975, 3, 'Береза     ', 'Немає      ', '48.537083', '25.042690', 'Немає'),
(34, 1932, 3, 'Абрикос  ', 'Абрикос  ', '48.536639', '25.050773', 'Немає'),
(36, 1954, 4, 'Каштан    ', 'Каштан    ', '48.535718', '25.053505', 'Немає'),
(37, 1975, 4, 'Дуб        ', 'Немає      ', '48.540740', '25.040566', 'Немає'),
(38, 2017, 4, 'Береза     ', 'Немає      ', '48.530577', '25.048027', 'Немає'),
(39, 1921, 4, 'Тополя', 'Немає', '48.543234', '25.041685', 'Немає'),
(40, 1921, 4, 'Тополя', 'Немає', '48.543123', '25.039076', 'Немає'),
(41, 1986, 3, 'Дуб', 'Немає', '48.540608', '25.036467', 'Немає'),
(42, 1986, 3, 'Дуб', 'Немає', '48.541764', '25.021887', 'Немає'),
(43, 1986, 3, 'Дуб', 'Немає', '48.539664', '25.031160', 'Немає'),
(44, 1986, 3, 'Дуб', 'Немає', '48.526918', '25.051693', 'Немає'),
(45, 1986, 3, 'Дуб', 'Немає', '48.528614', '25.038539', 'Немає'),
(46, 1986, 3, 'Дуб', 'Немає', '48.527857', '25.049029', 'Немає'),
(47, 1986, 3, 'Дуб', 'Немає', '48.532976', '25.044096', 'Немає'),
(48, 1698, 4, 'Тополя', 'Немає', '48.537592', '25.049614', 'Немає'),
(49, 1980, 5, 'Береза', 'Немає', '48.537602', '25.058731', 'Немає'),
(50, 1966, 5, 'Дуб', 'Немає', '48.549052', '25.028557', 'Немає'),
(51, 1972, 5, 'Магнолія', 'Немає', '48.530278', '25.038361', 'Рідкісне дерево'),
(52, 1969, 5, 'Гінкго Білоба', 'Немає', '48.527922', '25.047228', 'Листя цього дерева мають цілющі властивості');

-- --------------------------------------------------------

--
-- Структура таблиці `users`
--

CREATE TABLE `users` (
  `u_id` int(11) UNSIGNED NOT NULL,
  `u_name` varchar(100) NOT NULL,
  `u_surname` varchar(100) NOT NULL,
  `u_login` varchar(100) NOT NULL,
  `u_password` varchar(32) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп даних таблиці `users`
--

INSERT INTO `users` (`u_id`, `u_name`, `u_surname`, `u_login`, `u_password`) VALUES
(1, 'dimas', 'lenser', 'admin', '123'),
(2, 'Vasul', 'S4erbanyk', 'vasya', '123'),
(3, '????', '????', 'asul', '123'),
(4, 'хтось', 'хтось', 'hros', '1232'),
(5, 'igor', 'lesner', 'lenser2282', '123'),
(6, '123', '123', 'lenser228', '123'),
(7, 'loh', 'loh', 'lenser2281', '123'),
(8, 'вася', 'вася', 'vasik', '123'),
(9, 'Sajmon', 'Nagurski', 'sana', '123'),
(16, 'admin', 'admin', 'admin12', '123'),
(11, 'perto', 'banper', 'petro228', '123'),
(12, 'ads', 'asdas', 'admin1', '123'),
(13, 'jhjjg', 'ml,mm', 'admin9789', ';lklk,.m'),
(14, 'waad', 'essef', 'admin7iuyiuyyu', 'lkjkhkjkjh'),
(15, 'nnbmbn', 'kjhjjkh', 'admin34342', 'jhvjvbmh'),
(17, 'dsaa', 'sdsads', 'dimaslenser', '123');

--
-- Індекси збережених таблиць
--

--
-- Індекси таблиці `trees`
--
ALTER TABLE `trees`
  ADD UNIQUE KEY `id` (`t_id`);

--
-- Індекси таблиці `users`
--
ALTER TABLE `users`
  ADD UNIQUE KEY `id` (`u_id`);

--
-- AUTO_INCREMENT для збережених таблиць
--

--
-- AUTO_INCREMENT для таблиці `trees`
--
ALTER TABLE `trees`
  MODIFY `t_id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=53;

--
-- AUTO_INCREMENT для таблиці `users`
--
ALTER TABLE `users`
  MODIFY `u_id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
